Passionate0424/PSoC6_Lamp/Psoc6/board/GUI/events_init.c
/*
 * Copyright 2025 NXP
 * NXP Proprietary. This software is owned or controlled by NXP and may only be used strictly in
 * accordance with the applicable license terms. By expressly accepting such terms or by downloading, installing,
 * activating and/or otherwise using the software, you are agreeing that you have read, and that you agree to
 * comply with and are bound by, such license terms.  If you do not agree to be bound by the applicable license
 * terms, then you may not retain, install, activate or otherwise use the software.
 */

#include "events_init.h"
#include <stdio.h>
#include "lvgl.h"
#include "led_brightness_control.h"
#include "uart1.h"
#include <rtthread.h>
#include <rtdevice.h>
#include <time.h>
#include <drivers/alarm.h>
#include <gimbal_pid.h>
#include "cyhal_rtc.h"
#include "gui_guider.h"
#include "llm_contory.h"
#include "gimbal_pid.h"
extern cyhal_rtc_t rtc_obj;

#if LV_USE_GUIDER_SIMULATOR && LV_USE_FREEMASTER
#include "freemaster_client.h"
#endif

bool btn1_status = false; // false处于关灯状态，true处于开灯状态
bool guard_status = 0; // 0:未进入guard模式 1:进入guard模式

int bar_energy_value;
char bar_energy_char[5];
int bar_carefulness_value;
char bar_carefulness_char[5];
static bool work_btn_status = false;

static void home_btn_led_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_CLICKED:
    {
        // 还需适配灯的开关
        if (!btn1_status)
        {
            led_request_on(); // 开灯
            lv_obj_set_style_bg_color(guider_ui.home_btn_led, lv_color_hex(0x2195f6), LV_PART_MAIN | LV_STATE_DEFAULT);
            lv_label_set_text(guider_ui.home_btn_led_label, "ON");
            btn1_status = true;
        }
        else
        {
            led_request_off(); // 关灯
            lv_obj_set_style_bg_color(guider_ui.home_btn_led, lv_color_hex(0x8c8d8e), LV_PART_MAIN | LV_STATE_DEFAULT);
            lv_label_set_text(guider_ui.home_btn_led_label, "OFF");
            btn1_status = false;
        }

        break;
    }
    default:
        break;
    }
}

static void home_bright_slider_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_VALUE_CHANGED:
    {
        // 根据滑条调节亮度
        led_brightness = lv_slider_get_value(guider_ui.home_bright_slider);
        // rt_kprintf("[lvgl]LED Brightness: %d\n", led_brightness);
        break;
    }
    default:
        break;
    }
}

static void home_sw_2_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_VALUE_CHANGED:
    {
        lv_obj_t *status_obj = lv_event_get_target(e);
        int status = lv_obj_has_state(status_obj, LV_STATE_CHECKED) ? true : false;
        // 还需适配自动调光和手动调光

        switch (status)
        {
        case (true):
        {
            // 开关打开：显示滑块
            // lv_obj_add_flag(guider_ui.screen_bright_slider, LV_OBJ_FLAG_DISABLED);     // 4. 添加隐藏标记，让滑块不可见
            lv_obj_clear_flag(guider_ui.home_bright_slider, LV_OBJ_FLAG_CLICKABLE);                                                // 禁止点击
            lv_obj_clear_flag(guider_ui.home_bright_slider, LV_OBJ_FLAG_PRESS_LOCK);                                               // 禁止按压/拖动
            lv_obj_set_style_bg_color(guider_ui.home_bright_slider, lv_color_hex(0x808080), LV_PART_MAIN | LV_STATE_DEFAULT);      // 轨道
            lv_obj_set_style_bg_color(guider_ui.home_bright_slider, lv_color_hex(0x808080), LV_PART_INDICATOR | LV_STATE_DEFAULT); // 指示器
            lv_obj_set_style_bg_color(guider_ui.home_bright_slider, lv_color_hex(0x808080), LV_PART_KNOB | LV_STATE_DEFAULT);      // 旋钮
            led_bright_mode = 0;                                                                                                   // 设置为自动调光模式
            break;
        }
        case (false):
        {
            // 开关关闭：隐藏滑块
            // lv_obj_clear_flag(guider_ui.screen_bright_slider, LV_OBJ_FLAG_DISABLED);    // 1. 先清除隐藏标记，让滑块可见
            lv_obj_add_flag(guider_ui.home_bright_slider, LV_OBJ_FLAG_CLICKABLE);                                                  // 禁止点击
            lv_obj_add_flag(guider_ui.home_bright_slider, LV_OBJ_FLAG_PRESS_LOCK);                                                 // 禁止按压/拖动
            lv_obj_set_style_bg_color(guider_ui.home_bright_slider, lv_color_hex(0x0c6aff), LV_PART_MAIN | LV_STATE_DEFAULT);      // 轨道
            lv_obj_set_style_bg_color(guider_ui.home_bright_slider, lv_color_hex(0x0c6aff), LV_PART_INDICATOR | LV_STATE_DEFAULT); // 指示器
            lv_obj_set_style_bg_color(guider_ui.home_bright_slider, lv_color_hex(0x0c6aff), LV_PART_KNOB | LV_STATE_DEFAULT);      // 旋钮
            led_bright_mode = 1;                                                                                                   // 设置为手动调光模式
            break;
        }
        }
        break;
    }
    default:
        break;
    }
}

static void home_btn_monitor_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_CLICKED:
    {
        ui_load_scr_animation(&guider_ui, &guider_ui.monitor, guider_ui.monitor_del, &guider_ui.home_del, setup_scr_monitor, LV_SCR_LOAD_ANIM_NONE, 20, 20, true, false);
        break;
    }
    default:
        break;
    }
}

static void home_btn_guard_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_CLICKED:
    {
        ui_load_scr_animation(&guider_ui, &guider_ui.guader, guider_ui.guader_del, &guider_ui.home_del, setup_scr_guader, LV_SCR_LOAD_ANIM_NONE, 20, 20, true, false);
        // 适配守护模式开关
        guard_status = 1;
        uart_send_protocol("c", 2); // 发送追踪模式关
        uart_send_protocol("c", 16); // 发送推流关
        uart_send_protocol("c", 1); // 发送守护模式开关指令
        break;
    }
    default:
        break;
    }
}

static void home_btn_setting_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_CLICKED:
    {
        ui_load_scr_animation(&guider_ui, &guider_ui.settings, guider_ui.settings_del, &guider_ui.home_del, setup_scr_settings, LV_SCR_LOAD_ANIM_NONE, 20, 20, true, false);
        break;
    }
    default:
        break;
    }
}

static void home_btn_ai_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_LONG_PRESSED:
    {
        // 长按开始录音

        lv_obj_set_style_bg_color(guider_ui.home_btn_ai, lv_color_hex(0x2195f6), LV_PART_MAIN | LV_STATE_DEFAULT);
        lv_label_set_text(guider_ui.home_btn_ai_label, "录音中...");
        uart_send_protocol("c", 05);

        break;
    }
    case LV_EVENT_RELEASED:
    {
        // 松开结束录音

        lv_obj_set_style_bg_color(guider_ui.home_btn_ai, lv_color_hex(0x00E0FF), LV_PART_MAIN | LV_STATE_DEFAULT);
        lv_label_set_text(guider_ui.home_btn_ai_label, "按住说话");
        uart_send_protocol("c", 15); // 发送结束录音指令
        break;
    }
    default:
        break;
    }
}

void events_init_home(lv_ui *ui)
{
    lv_obj_add_event_cb(ui->home_btn_led, home_btn_led_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->home_bright_slider, home_bright_slider_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->home_sw_2, home_sw_2_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->home_btn_monitor, home_btn_monitor_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->home_btn_guard, home_btn_guard_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->home_btn_setting, home_btn_setting_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->home_btn_ai, home_btn_ai_event_handler, LV_EVENT_ALL, ui);
}

static void monitor_temperature_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_CLICKED:
    {
        lv_obj_clear_flag(guider_ui.monitor_win_temperature, LV_OBJ_FLAG_HIDDEN);
        break;
    }
    default:
        break;
    }
}

static void monitor_humidity_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_CLICKED:
    {
        lv_obj_clear_flag(guider_ui.monitor_win_humidity, LV_OBJ_FLAG_HIDDEN);
        break;
    }
    default:
        break;
    }
}

static void monitor_heart_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_CLICKED:
    {
        lv_obj_clear_flag(guider_ui.monitor_win_heart, LV_OBJ_FLAG_HIDDEN);
        break;
    }
    default:
        break;
    }
}

