Passionate0424/PSoC6_Lamp/Psoc6/board/GUI/events_init.c
static void monitor_breath_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_CLICKED:
    {
        lv_obj_clear_flag(guider_ui.monitor_win_breath, LV_OBJ_FLAG_HIDDEN);
        break;
    }
    default:
        break;
    }
}

static void monitor_btn_env_advice_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_CLICKED:
    {
        // 适配调用ai获取环境建议

        llm_send_env();
        // rt_mutex_release(llm_mutex);

        break;
    }
    default:
        break;
    }
}

static void monitor_bar_energy_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_VALUE_CHANGED:
    {
        bar_energy_value = lv_bar_get_value(guider_ui.monitor_bar_energy);
        sprintf(bar_energy_char, "%d%%", bar_energy_value);
        lv_label_set_text(guider_ui.monitor_label_energy, bar_energy_char);

        break;
    }
    default:
        break;
    }
}

static void monitor_bar_carefulness_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_VALUE_CHANGED:
    {
        bar_carefulness_value = lv_bar_get_value(guider_ui.monitor_bar_carefulness);
        sprintf(bar_carefulness_char, "%d%%", bar_carefulness_value);
        lv_label_set_text(guider_ui.monitor_label_carefulness, bar_carefulness_char);
        break;
    }
    default:
        break;
    }
}

#include <rtthread.h>

static rt_timer_t work_timer = RT_NULL;
static rt_timer_t rest_timer = RT_NULL;
rt_timer_t water_timer = RT_NULL;
static rt_int8_t work_time = 0; // 工作时间
static rt_int8_t rest_time = 0;
static rt_int8_t loop_count = 0; // 循环次数
static float water_interval = 0; // 喝水提醒间隔时间
static rt_int8_t work_count = 0; // 工作次数计数
static rt_int8_t rest_count = 0; // 休息次数计数

static void work_timer_callback(void *parameter)
{
    rt_kprintf("[lvgl]休息时间到！\n");
    // 这里可以添加工作结束后的UI、串口等业务逻辑
    monitor_data.is_working = false; // 设置为休息状态
    if (rest_count > 0)
    {
        rest_count--;
        rt_kprintf("[lvgl]启动休息定时器，剩余休息次数: %d\n", rest_count);
        uart_send_protocol("c", 8); // 发送提醒休息指令
        rt_timer_start(rest_timer);
    }
}

static void rest_timer_callback(void *parameter)
{
    // 这里可以添加休息结束后的UI、串口等业务逻辑
    if (work_count > 0)
    {
        monitor_data.is_working = true; // 设置为工作状态
        rt_kprintf("[lvgl]工作时间到！\n");
        work_count--;
        rt_kprintf("[lvgl]启动工作定时器，剩余工作次数: %d\n", work_count);
        uart_send_protocol("c", 18); // 发送提醒工作指令
        rt_timer_start(work_timer);
    }
    else
    {
        uart_send_protocol("c", 17);     // 发送工作模式结束指令
        rt_sem_release(lv_rest_end_sem); // 休息结束，发送信号通知
        
    }
}



static void water_timer_callback(void *parameter)
{
    rt_kprintf("[lvgl]喝水提醒！\n");
    // 这里可以添加喝水提醒的UI、蜂鸣器等业务逻辑
    uart_send_protocol("c", 9);  // 发送喝水提醒指令
    rt_timer_start(water_timer); // 循环提醒
}

void drink_timer_restart(void)
{
    if (water_timer)
    {
        // 如果喝水定时器已存在，先删除它
        rt_timer_delete(water_timer);
        water_timer = RT_NULL; // 重置喝水定时器指针
    }
    if (water_timer == RT_NULL)
    {
        water_timer = rt_timer_create("water_timer", water_timer_callback, RT_NULL, (water_interval * 60 * RT_TICK_PER_SECOND), RT_TIMER_FLAG_PERIODIC);
        if (water_timer == RT_NULL)
        {
            rt_kprintf("[lvgl]创建喝水定时器失败！\n");
            return;
        }
    }
    rt_timer_start(water_timer);
}

static void monitor_work_btn_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);

    switch (code)
    {
    case LV_EVENT_CLICKED:
    {
        // 适配监测模式的开关
        if (!work_btn_status)
        {
            // 开
            // 工作时间
            if (lv_obj_has_state(guider_ui.monitor_sw_demo, LV_STATE_CHECKED) != true)
            {
                switch (lv_dropdown_get_selected(guider_ui.monitor_ddlist_work_time))
                {
                case 0:
                    work_time = 30; // 30min
                    break;
                case 1:
                    work_time = 60; // 1h
                    break;
                case 2:
                    work_time = 90; // 1.5h
                    break;
                case 3:
                    work_time = 120; // 2h
                    break;
                case 4:
                    work_time = 2; // 2min
                    break;
                default:
                    work_time = 0;
                    rt_kprintf("[lvgl]Invalid work time selection.\n");
                    break;
                }
                // 休息时间
                switch (lv_dropdown_get_selected(guider_ui.monitor_ddlist_rest_time))
                {
                case 0:
                    rest_time = 5; // 5min
                    break;
                case 1:
                    rest_time = 10; // 10min
                    break;
                case 2:
                    rest_time = 15; // 15min
                    break;
                case 3:
                    rest_time = 30; // 30min
                    break;
                case 4:
                    rest_time = 60; // 1h
                    break;
                case 5:
                    rest_time = 1; // 1min
                    break;
                default:
                    rest_time = 0;
                    rt_kprintf("[lvgl]Invalid rest time selection.\n");
                    break;
                }
                // 循环次数
                switch (lv_dropdown_get_selected(guider_ui.monitor_ddlist_loop))
                {
                case 0:
                    loop_count = 1; // 1次
                    break;
                case 1:
                    loop_count = 2; // 2次
                    break;
                case 2:
                    loop_count = 3; // 3次
                    break;
                case 3:
                    loop_count = 4; // 4次
                    break;
                case 4:
                    loop_count = 5;
                    break;
                }
                // 喝水提醒间隔时间
                switch (lv_dropdown_get_selected(guider_ui.monitor_ddlist_water))
                {
                case 0:
                    water_interval = 30; // 30min
                    break;
                case 1:
                    water_interval = 60; // 1h
                    break;
                case 2:
                    water_interval = 90; // 1.5h
                    break;
                case 3:
                    water_interval = 2; // 2min
                    break;
                case 4:
                    water_interval = 0.5; // 30s
                    break;
                default:
                    water_interval = 0;
                    rt_kprintf("[lvgl]Invalid water reminder interval selection.\n");
                    break;
                }

