Passionate0424/PSoC6_Lamp/Psoc6/board/GUI/events_init.c
                // 更新分数计算结构体
                monitor_setting.work_time = work_time; // 工作时间（分钟）
                monitor_setting.rest_time = rest_time; // 休息时间（分钟）
                monitor_setting.loop = loop_count;     // 循环次数
                monitor_data.work_duration = 0;
                monitor_data.phone_duration = 0; // 初始化工作和玩手机持续时间
                monitor_data.sum_time = 0;       // 初始化总时间
                monitor_data.is_working = true;  // 设置为工作状态
                energy = 100.0f;                 // 初始化能量值
                work_score = 100.0f;             // 初始化工作分数
                carefulness = 100.0f;            // 初始化专注度

                // 设置时钟计数
                work_count = loop_count - 1;
                rest_count = loop_count;

                // 删除旧定时器
                if (work_timer)
                {
                    rt_timer_delete(work_timer);
                    work_timer = RT_NULL; // 重置定时器指针
                }
                if (rest_timer)
                {
                    rt_timer_delete(rest_timer);
                    rest_timer = RT_NULL; // 重置定时器指针
                }
                if (water_timer)
                {
                    rt_timer_delete(water_timer);
                    water_timer = RT_NULL; // 重置喝水定时器指针
                }

                // 创建新定时器
                work_timer = rt_timer_create("work", work_timer_callback, RT_NULL, work_time * 60 * RT_TICK_PER_SECOND, RT_TIMER_FLAG_ONE_SHOT);
                rest_timer = rt_timer_create("rest", rest_timer_callback, RT_NULL, rest_time * 60 * RT_TICK_PER_SECOND, RT_TIMER_FLAG_ONE_SHOT);
                // work_timer = rt_timer_create("work", work_timer_callback, RT_NULL, 6 * RT_TICK_PER_SECOND, RT_TIMER_FLAG_ONE_SHOT);
                // rest_timer = rt_timer_create("rest", rest_timer_callback, RT_NULL, 6 * RT_TICK_PER_SECOND, RT_TIMER_FLAG_ONE_SHOT);
                water_timer = rt_timer_create("water", water_timer_callback, RT_NULL, (int)(water_interval * 60 * RT_TICK_PER_SECOND), RT_TIMER_FLAG_ONE_SHOT);

                // 启动工作和喝水定时器
                rt_timer_start(work_timer);
                rt_timer_start(water_timer);

                uart_send_protocol("c", 07); // 发送工作模式启动指令

                // 启动工作计算线程
                monitor_calc_start();

                rt_kprintf("[lvgl]工作定时器启动: %d分钟，休息定时器: %d分钟，喝水提醒: %.1f分钟\n", work_time, rest_time, water_interval);
            }
            else
            {
                // 演示模式，直接启动工作定时器
                work_time = 1;        // 1分钟
                rest_time = 0.5;      // 30秒
                water_interval = 0.3; // 18秒

                monitor_setting.work_time = work_time; // 工作时间（分钟）
                monitor_setting.rest_time = rest_time; // 休息时间（分钟）
                monitor_setting.loop = 2;              // 循环次数

                monitor_data.work_duration = 0;
                monitor_data.phone_duration = 0; // 初始化工作和玩手机持续时间
                monitor_data.sum_time = 0;       // 初始化总时间
                monitor_data.is_working = true;  // 设置为工作状态
                energy = 100.0f;                 // 初始化能量值
                work_score = 100.0f;             // 初始化工作分数
                carefulness = 100.0f;            // 初始化专注度

                work_count = 1;
                rest_count = 2; // 演示模式，工作1次，休息2次

                if (work_timer)
                {
                    rt_timer_delete(work_timer);
                    work_timer = RT_NULL; // 重置定时器指针
                }
                if (rest_timer)
                {
                    rt_timer_delete(rest_timer);
                    rest_timer = RT_NULL; // 重置定时器指针
                }
                if (water_timer)
                {
                    rt_timer_delete(water_timer);
                    water_timer = RT_NULL; // 重置喝水定时器指针
                }

                work_timer = rt_timer_create("work", work_timer_callback, RT_NULL, work_time * 60 * RT_TICK_PER_SECOND, RT_TIMER_FLAG_ONE_SHOT);
                rest_timer = rt_timer_create("rest", rest_timer_callback, RT_NULL, rest_time * 60 * RT_TICK_PER_SECOND, RT_TIMER_FLAG_ONE_SHOT);
                water_timer = rt_timer_create("water", water_timer_callback, RT_NULL, (int)(water_interval * 60 * RT_TICK_PER_SECOND), RT_TIMER_FLAG_ONE_SHOT);

                rt_timer_start(work_timer);
                rt_timer_start(water_timer);

                uart_send_protocol("c", 07); // 发送工作模式启动指令

                monitor_calc_start(); // 启动工作计算线程

                rt_kprintf("==================演示模式开始==================\n");
            }
            lv_obj_set_style_bg_color(guider_ui.monitor_work_btn, lv_color_hex(0x2195f6), LV_PART_MAIN | LV_STATE_DEFAULT);
            lv_label_set_text(guider_ui.monitor_work_btn_label, "STOP");
            lv_obj_clear_flag(guider_ui.monitor_spinner_1, LV_OBJ_FLAG_HIDDEN);
            work_btn_status = true;
        }
        else
        {
            // 关闭定时器
            if (work_timer)
            {
                rt_timer_delete(work_timer);
            }
            work_timer = RT_NULL; // 重置定时器指针}
            if (rest_timer)
            {
                rt_timer_delete(rest_timer);
                rest_timer = RT_NULL; // 重置定时器指针
            }
            if (water_timer)
            {
                rt_timer_delete(water_timer);
                water_timer = RT_NULL; // 重置定时器指针
            }
            rt_kprintf("[lvgl]所有定时器已关闭\n");
            // 关
            lv_obj_set_style_bg_color(guider_ui.monitor_work_btn, lv_color_hex(0x8c8d8e), LV_PART_MAIN | LV_STATE_DEFAULT);
            lv_label_set_text(guider_ui.monitor_work_btn_label, "START");
            lv_obj_add_flag(guider_ui.monitor_spinner_1, LV_OBJ_FLAG_HIDDEN);
            work_btn_status = false;
        }
        break;
    }
    default:
        break;
    }
}

static void monitor_ddlist_work_time_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_VALUE_CHANGED:
    {
        uint16_t id = lv_dropdown_get_selected(guider_ui.monitor_ddlist_work_time);
        // 适配监测模式连续工作时间设置
        // 30min-0 1h-1 1.5h-2 2h-3 2min-4
        rt_kprintf("[lvgl]Selected work time: %d\n", id);
        break;
    }
    default:
        break;
    }
}

static void monitor_ddlist_rest_time_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_VALUE_CHANGED:
    {
        uint16_t id = lv_dropdown_get_selected(guider_ui.monitor_ddlist_rest_time);
        // 适配监测模式休息时间设置
        // 5min-0 10min-1 15min-2 30min-3 1h-4 1min-5
        rt_kprintf("[lvgl]Selected rest time: %d\n", id);
        break;
    }
    default:
        break;
    }
}

static void monitor_ddlist_loop_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_VALUE_CHANGED:
    {
        uint16_t id = lv_dropdown_get_selected(guider_ui.monitor_ddlist_loop);
        // 适配监测模式循环次数设置
        // 1 2 3 4 5
        rt_kprintf("[lvgl]Selected loop count: %d\n", id);
        break;
    }
    default:
        break;
    }
}

static void monitor_ddlist_water_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_VALUE_CHANGED:
    {
        uint16_t id = lv_dropdown_get_selected(guider_ui.monitor_ddlist_water);
        // 适配喝水提醒间隔时间
        // 30min-0 1h-1 1.5h-2 2min-3 30s-4
        rt_kprintf("[lvgl]Selected water reminder interval: %d\n", id);
        break;
    }
    default:
        break;
    }
}

static void monitor_btn_1_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_CLICKED:
    {
        ui_load_scr_animation(&guider_ui, &guider_ui.home, guider_ui.home_del, &guider_ui.monitor_del, setup_scr_home, LV_SCR_LOAD_ANIM_NONE, 20, 20, true, false);
        break;
    }
    default:
        break;
    }
}

static void monitor_win_heart_item0_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_CLICKED:
    {
        lv_obj_add_flag(guider_ui.monitor_win_heart, LV_OBJ_FLAG_HIDDEN);
        break;
    }
    default:
        break;
    }
}

static void monitor_win_breath_item0_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_CLICKED:
    {
        lv_obj_add_flag(guider_ui.monitor_win_breath, LV_OBJ_FLAG_HIDDEN);
        break;
    }
    default:
        break;
    }
}

static void monitor_win_temperature_item0_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_CLICKED:
    {
        lv_obj_add_flag(guider_ui.monitor_win_temperature, LV_OBJ_FLAG_HIDDEN);
        break;
    }
    default:
        break;
    }
}

static void monitor_win_humidity_item0_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_CLICKED:
    {
        lv_obj_add_flag(guider_ui.monitor_win_humidity, LV_OBJ_FLAG_HIDDEN);
        break;
    }
    default:
        break;
    }
}

void events_init_monitor(lv_ui *ui)
{
    lv_obj_add_event_cb(ui->monitor_temperature, monitor_temperature_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->monitor_humidity, monitor_humidity_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->monitor_heart, monitor_heart_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->monitor_breath, monitor_breath_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->monitor_btn_env_advice, monitor_btn_env_advice_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->monitor_bar_energy, monitor_bar_energy_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->monitor_bar_carefulness, monitor_bar_carefulness_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->monitor_work_btn, monitor_work_btn_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->monitor_ddlist_work_time, monitor_ddlist_work_time_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->monitor_ddlist_rest_time, monitor_ddlist_rest_time_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->monitor_ddlist_loop, monitor_ddlist_loop_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->monitor_ddlist_water, monitor_ddlist_water_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->monitor_btn_1, monitor_btn_1_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->monitor_win_heart_item0, monitor_win_heart_item0_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->monitor_win_breath_item0, monitor_win_breath_item0_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->monitor_win_temperature_item0, monitor_win_temperature_item0_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->monitor_win_humidity_item0, monitor_win_humidity_item0_event_handler, LV_EVENT_ALL, ui);
}

static void settings_btn_1_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_CLICKED:
    {
        ui_load_scr_animation(&guider_ui, &guider_ui.home, guider_ui.home_del, &guider_ui.settings_del, setup_scr_home, LV_SCR_LOAD_ANIM_NONE, 20, 20, true, false);
        break;
    }
    default:
        break;
    }
}

