Passionate0424/PSoC6_Lamp/Psoc6/board/GUI/events_init.c
static void settings_ddlist_switch_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_VALUE_CHANGED:
    {
        uint16_t id = lv_dropdown_get_selected(guider_ui.settings_ddlist_switch);
        rt_kprintf("[lvgl]Selected switch mode: %d\n", id);
        // 适配台灯开关模式设置
        if (id == 0)
        {
            // 自动开关
            lv_obj_add_flag(guider_ui.home_btn_led, LV_OBJ_FLAG_HIDDEN);
            led_auto_switch(); // 切换为自动开关模式`
        }
        else if (id == 1)
        {
            // 手动开关
            lv_obj_clear_flag(guider_ui.home_btn_led, LV_OBJ_FLAG_HIDDEN);
            led_manual_switch(); // 切换为手动开关模式
        }
        break;
    }
    default:
        break;
    }
}

static void settings_ddlist_1_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_VALUE_CHANGED:
    {
        uint16_t id = lv_dropdown_get_selected(guider_ui.settings_ddlist_1);
        rt_kprintf("[lvgl]Selected tracking mode: %d\n", id);
        // 适配台灯追踪模式设置
        // 关-0 书本-1 手-2
        switch (id)
        {
        case 0:
            // 关闭追踪模式
            uart_send_protocol("c", 2); // 发送关闭追踪模式指令
            // 关闭追踪
            gimbal_stop_tracking(); // 停止追踪
            break;
        case 1:
            // 书本追踪模式
            uart_send_protocol("c", 4); // 发送书本追踪模式指令
            // 开启书本追踪
            gimbal_start_tracking(); // 开始追踪
            break;
        case 2:
            // 手追踪模式
            uart_send_protocol("c", 3); // 发送手追踪模式指令
            // 开启手追踪
            gimbal_start_tracking(); // 开始手追踪
            break;
        }
        break;
    }
    }
}

void events_init_settings(lv_ui *ui)
{
    lv_obj_add_event_cb(ui->settings_btn_1, settings_btn_1_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->settings_ddlist_switch, settings_ddlist_switch_event_handler, LV_EVENT_ALL, ui);
    lv_obj_add_event_cb(ui->settings_ddlist_1, settings_ddlist_1_event_handler, LV_EVENT_ALL, ui);
}

static void guader_btn_1_event_handler(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    switch (code)
    {
    case LV_EVENT_CLICKED:
    {
        ui_load_scr_animation(&guider_ui, &guider_ui.home, guider_ui.home_del, &guider_ui.guader_del, setup_scr_home, LV_SCR_LOAD_ANIM_NONE, 20, 20, true, false);
        guard_status = 0;
        uart_send_protocol("c", 16); // 发送推流关
        uart_send_protocol("c", 11); // 发送守护模式关闭指令
        int id = lv_dropdown_get_selected(guider_ui.settings_ddlist_1);
        switch (id)
        {
        case 0:
            uart_send_protocol("c", 2);
            break;
        case 1:
            uart_send_protocol("c", 4);
            break;
        case 2:
            uart_send_protocol("c", 3);
            break;
        default:
            break;
        }
        break;
    }
    default:
        break;
    }
}

void events_init_guader(lv_ui *ui)
{
    lv_obj_add_event_cb(ui->guader_btn_1, guader_btn_1_event_handler, LV_EVENT_ALL, ui);
}

void events_init(lv_ui *ui)
{
}
